Vidicon/sanbot_elf_hacking/mcu_down/stm32f207_matthijs/Actuators/Arms/Src/Arms.c
#include "Arms.h"
#include "stm32f2xx.h"
#include <main.h>
#include "Encoders.h"
#include "RGBLeds.h"

struct Arm_State_Type LeftArm_State;
struct Arm_State_Type RightArm_State;

//----------------------------------------------------------------
//
//----------------------------------------------------------------
void LeftArm_Init(TIM_HandleTypeDef *htim)
{
	LeftArm_State.Angle = 0;
	LeftArm_State.Direction = Arm_Up;
	LeftArm_State.Homed = Arm_NotHomed;
	LeftArm_State.MotionState = Arm_Motion_Disabled;
	LeftArm_State.Timer = 0;
	LeftArm_State.SelTestRunning = 0;
	LeftArm_State.TIM = htim;
	LeftArm_State.Speed = 0;

	HAL_TIM_Base_Start(htim);
	HAL_TIM_PWM_Start(htim, TIM_CHANNEL_1);
}

void LeftArm_SelfTest(enum ENUM_Booleans Enabled)
{
	if (Enabled)
	{
		LeftArm_EnableBrake(False);
		LeftArm_State.SelTestRunning = 1;
		LeftArm_State.MotionState = Arm_Motion_MovingUp;
		LeftArm_State.Speed = 10;
	}
	else
	{
		LeftArm_EnableBrake(True);
		LeftArm_State.SelTestRunning = 0;
		LeftArm_State.MotionState = Arm_Motion_Disabled;
		LeftArm_State.Speed = 0;
	}
}

void LeftArm_MoveToAngle(int TargetAngle)
{
	// Move if correctly homed
}

void LeftArm_Update20Hz(struct Encoders_Data_Type EncoderData)
{
	//----------------------------------------------------------------------------
	//  Check if selftest is running
	//----------------------------------------------------------------------------
//	if (LeftArm_State.SelTestRunning == 1)
//	{
//		LeftArm_State.Timer += 1;
//
//		if (LeftArm_State.Timer <= 1 * UPDATE_10HZ)
//		{
//			LeftArm_State.MotionState = Arm_Motion_MovingUp;
//		}
//		else if (LeftArm_State.Timer <= 2 * UPDATE_10HZ)
//		{
//			LeftArm_State.MotionState = Arm_Motion_MovingDown;
//		}
//		else
//		{
//			LeftArm_State.MotionState = Arm_Motion_AtTarget;
//		}
//	}

	//----------------------------------------------------------------------------
	// Feedback controller
	//----------------------------------------------------------------------------
	LeftArm_State.ActualPosition = EncoderData.Encoder[3];

	LeftArm_State.SetpointPosition = LeftArm_State.TargetPosition;
	int error = LeftArm_State.SetpointPosition - LeftArm_State.ActualPosition;

	// Check end-condition
	if ((LeftArm_State.SetpointState == +1) && (error <= 30)) { LeftArm_State.SetpointState = 0;}
	if ((LeftArm_State.SetpointState == -1) && (error >= -30)) { LeftArm_State.SetpointState = 0;}

	if (LeftArm_State.SetpointState == 1)
	{
		RGBLeds_SetColorOff(LeftArm);
		RGBLeds_SetColorOn(LeftArm, Blue);
	}

	if (LeftArm_State.SetpointState == -1)
	{
		RGBLeds_SetColorOff(LeftArm);
		RGBLeds_SetColorOn(LeftArm, Red);
	}

	if (LeftArm_State.SetpointState == 0)
	{
		RGBLeds_SetColorOff(LeftArm);
		RGBLeds_SetColorOn(LeftArm, Green);
	}

	int controller = 0;

	if ((LeftArm_State.SetpointState == 1) || (LeftArm_State.SetpointState == -1))
	{
		LeftArm_State.Differential = error - LeftArm_State.ErrorPrev;
		LeftArm_State.ErrorPrev = error;
		LeftArm_State.Integral += error;

		int kp = 20 * error;
		int Max_Kp = 500;

		if (kp > Max_Kp) {kp = Max_Kp;}
		if (kp < -Max_Kp) {kp = -Max_Kp;}

		int kd = 50 * LeftArm_State.Differential;
		int Max_Kd = 500;

		if (kd > Max_Kd) {kd = Max_Kd;}
		if (kd < -Max_Kd) {kd = -Max_Kd;}

		controller = kp + kd + LeftArm_State.SetpointState * 1000;

		// Feedback controller
		if (controller >= 0)
		{
			LeftArm_State.AmplifierSetpoint = controller/100;
			LeftArm_State.MotionState = Arm_Motion_MovingDown;
		}
		else
		{
			LeftArm_State.AmplifierSetpoint = -1 * controller/100;
			LeftArm_State.MotionState = Arm_Motion_MovingUp;
		}
	}
	else if (LeftArm_State.SetpointState == 0)
	{
		controller = 0;
		LeftArm_State.Integral = 0;
		LeftArm_State.MotionState = Arm_Motion_AtTarget;
	}
	else
	{

	}

//		// Motion controller overruled.
//		controller = 0;
//		LeftArm_State.Integral = 0;
//		LeftArm_State.MotionState = Arm_Motion_Disabled;


	// TIM 9 counter = 100.
	int max = 25;
	if (LeftArm_State.AmplifierSetpoint > max) {LeftArm_State.AmplifierSetpoint  = max;}
	if (LeftArm_State.AmplifierSetpoint < -max) {LeftArm_State.AmplifierSetpoint  = -max;}

	//----------------------------------------------------------------------------
	// Write correct outputs
	//----------------------------------------------------------------------------
	if (LeftArm_State.MotionState == Arm_Motion_MovingUp)
	{
		__HAL_TIM_SET_COMPARE(LeftArm_State.TIM, TIM_CHANNEL_1, LeftArm_State.AmplifierSetpoint);
		HAL_GPIO_WritePin(LeftArmUp_GPIO_Port, LeftArmUp_Pin, GPIO_PIN_SET);
		LeftArm_EnableBrake(False);
	}
	else if (LeftArm_State.MotionState == Arm_Motion_MovingDown)
	{
		__HAL_TIM_SET_COMPARE(LeftArm_State.TIM, TIM_CHANNEL_1, LeftArm_State.AmplifierSetpoint);
		HAL_GPIO_WritePin(LeftArmUp_GPIO_Port, LeftArmUp_Pin, GPIO_PIN_RESET);
		LeftArm_EnableBrake(False);
	}
	else if (LeftArm_State.MotionState == Arm_Motion_AtTarget)
	{
		__HAL_TIM_SET_COMPARE(LeftArm_State.TIM, TIM_CHANNEL_1, 0);
//		LeftArm_EnableBrake(True);
	}
	else //Disabled, brake released
	{
		__HAL_TIM_SET_COMPARE(LeftArm_State.TIM, TIM_CHANNEL_1, 0);
		LeftArm_EnableBrake(False);
	}
}

void LeftArm_EnableBrake(enum ENUM_Booleans BrakeEnable)
{
	// Works inverted. High to release brake.
	HAL_GPIO_WritePin(LeftArmBrake_GPIO_Port, LeftArmBrake_Pin, !BrakeEnable);
}

void LeftArm_NewSetpoint(int NewSetpoint)
{
	// Check if new setpoint is different from current position
	LeftArm_State.TargetPosition = NewSetpoint;

	LeftArm_State.SetpointState = 0;

	if (NewSetpoint > LeftArm_State.ActualPosition)
	{
		LeftArm_State.SetpointState = 1;
	}

	if (NewSetpoint < LeftArm_State.ActualPosition)
	{
		LeftArm_State.SetpointState = -1;
	}
}

//----------------------------------------------------------------
//
//----------------------------------------------------------------
void RightArm_Init(TIM_HandleTypeDef *htim)
{
	RightArm_State.Angle = 0;
	RightArm_State.Direction = Arm_Up;
	RightArm_State.Homed = Arm_NotHomed;
	RightArm_State.MotionState = Arm_Motion_Disabled;
	RightArm_State.Timer = 0;
	RightArm_State.SelTestRunning = 0;
	RightArm_State.TIM = htim;
	RightArm_State.Speed = 0;

	HAL_TIM_Base_Start(htim);
	HAL_TIM_PWM_Start(htim, TIM_CHANNEL_2);
}

void RightArm_SelfTest(enum ENUM_Booleans Enabled)
{
	if (Enabled)
	{
		RightArm_EnableBrake(False);
		RightArm_State.SelTestRunning = 1;
		RightArm_State.MotionState = Arm_Motion_MovingUp;
		RightArm_State.Speed = 10;
	}
	else
	{
		RightArm_EnableBrake(True);
		RightArm_State.SelTestRunning = 0;
		RightArm_State.MotionState = Arm_Motion_Disabled;
		RightArm_State.Speed = 0;
	}
}

void RightArm_MoveToAngle(int TargetAngle)
{

}

void RightArm_Update20Hz()
{
	// Write correct outputs
	if (RightArm_State.MotionState == Arm_Motion_MovingUp)
	{
		__HAL_TIM_SET_COMPARE(RightArm_State.TIM, TIM_CHANNEL_2, RightArm_State.Speed);

		HAL_GPIO_WritePin(RightArmUp_GPIO_Port, RightArmUp_Pin, GPIO_PIN_SET);

		RightArm_EnableBrake(False);
	}
	else if (RightArm_State.MotionState == Arm_Motion_MovingDown)
	{
		__HAL_TIM_SET_COMPARE(RightArm_State.TIM, TIM_CHANNEL_2, RightArm_State.Speed);

		HAL_GPIO_WritePin(RightArmUp_GPIO_Port, RightArmUp_Pin, GPIO_PIN_RESET);

		RightArm_EnableBrake(False);
	}
	else
	{
		__HAL_TIM_SET_COMPARE(RightArm_State.TIM, TIM_CHANNEL_2, 0);
	}
}

void RightArm_EnableBrake(enum ENUM_Booleans BrakeEnable)
{
	// Works inverted. High to release brake.
	HAL_GPIO_WritePin(RightArmBrake_GPIO_Port, RightArmBrake_Pin, !BrakeEnable);
}

